# Файл для хранения и изменения всех текстов
# Markup language - MarkdownV2

start_text = '*Привет\\!* \n' \
             'Это бот для добавления сумм, наеденного за период подготовки к кубку ректора\\. \n \n' \
             'Например: \n' \
             'Ты после тренировки танцев пошёл в ~мак~ вкусно и точка и заказал там три чизбургера на 213 рублей\\.\n' \
             'Сразу после оплаты ты заходишь в этого бота и присылаешь сюда сумму\\.\n \n' \
             '||В конце на отчётном собрании мы огласим результаты, а главное, узнаем сколько в итоге мы коллективно ' \
             'потратили\\.||'

menu_text = 'Снизу разные кнопочки, на которые можно нажимать 🤭'

categories_text = '*Выбери фастфуд:*'

summ_text = '*Введи сумму:*'

error_number_text = '*Ошибка\\!*\n' \
                    'Скорее всего вы ввели не число, повторите ввод 😕'

error_negative_number_text = 'Никаких отрицательных чисел\\! 😤\n' \
                             'Введи нормальную сумму и не балуйся\\!'

complete_transaction_text = 'Успешно добавлено 🥳\n\n' \
                            'Если вы ошиблись, то можно удалить добавление в разделе ' \
                            '*Транзакции*'

transactions_text_1 = 'Это твоя сумма\\:'
transactions_text_2 = '*Транзакции\\:*'

information_text = 'Вы думали декораторы умеют только оригами складывать\\?\n' \
                   'А, нет, ||выкусите||\n\n' \
                   'Prod by:\n' \
                   'dev – @bozhenkas\n' \
                   'smm – @ksusha\\_xrushaa'

delete_text = '*Вы уверены, что хотите удалить транзакцию\\?*'

edit_text = '*пу\\-пу\\-пу\\.\\.\\.\n \n*' \
            'редактирование в разработке, пожалуйста воспользуйтесь удалением, а затем добавьте заново 😶‍🌫️'

success_delete_text = 'Транзакция успешно удалена из базы\\! 🥳'

failing_delete_text = 'Произошла ошибка во время удаления 🫣'
