# Файл для хранения и изменения всех текстов
# Markup language - MarkdownV2

start_text = '*Привет\\!* \n' \
             'Это бот для добавления сумм, наеденного за период подготовки к кубку ректора\\. \n \n' \
             'Например: \n' \
             'Ты после тренировки танцев пошёл в ~мак~ вкусно и точка и заказал там три чизбургера на 213 рублей\\.\n' \
             'Сразу после оплаты ты заходишь в этого бота и присылаешь сюда сумму\\.\n \n' \
             '||В конце на отчётном собрании мы огласим результаты, а главное, узнаем сколько в итоге мы коллективно ' \
             'потратили\\.||'

menu_text = '*Меню:*'

categories_text = '*Выбери фастфуд:*'

summ_text = '*Введи сумму:*'

error_number_text = '*Ошибка\\!*\n' \
                    'Скорее всего вы ввели не число, повторите ввод 😕'

complete_transaction_text = 'Успешно добавлено 🥳\n\n' \
                            'Если вы ошиблись, то можно удалить добавление в разделе \n' \
                            '🧾 Транзакции'

transactions_text = 'Тут будет реализован метод управления транзакциями, а пока тут общая сумма:'

information_text = 'Тут будет текст раздела информация, а пока прикол\\.\\.\\.\n' \
                   '||╱╱▏┈┈╱╱╱╱▏╱╱▏\n' \
                   '▇╱▏┈┈▇▇▇╱▏▇╱▏\n' \
                   '▇╱▏▁┈▇╱▇╱▏▇╱▏▁\n' \
                   '▇╱╱╱▏▇╱▇╱▏▇╱╱╱\n' \
                   '▇▇▇╱┈▇▇▇╱┈▇▇▇╱||'
